Repository: 84000/data-translation-memory
Catalog: Toh_147-The_Teaching_on_the_Great_Compassion_of_the_Tathagata-v1.tmx
Source language: bo
Languages: en

source: བཅོམ་ལྡན་འདས་གང་ཐོས་པས་བདག་ཅག་དེ་བཞིན་དུ་སྒྲུབ་ཅིང་། གཟུངས་འདི་འཐོབ་པར་འགྱུར་བར་དེ་བཞིན་གཤེགས་པས་རིན་ཆེན་སྒྲོན་མའི་གཟུངས་ལ་གང་ཆུང་ཟད་འཇུག་པ་ཙམ་ཞིག་ལེགས་པར་བཤད་དུ་གསོལ།
en: ‘Blessed One, please introduce the jewel lamp dhāraṇī so that we may practice accordingly what we hear and so that we may attain this dhāraṇī.’

source: དེ་ནས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བས། བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་ལ་ཚིགས་སུ་བཅད་དེ་བཀའ་སྩལ་པ།
en: In reply the Tathāgata uttered the following verses:

source: ཉོན་མོངས་རྣམས་ཀྱི་རྡུལ་དང་བྲལ་གྱུར་ཏེ།
en: “ ‘Freed from the dregs of afflictive emotions,

source: དྲི་མ་མེད་ཅིང་དྲི་མ་ཀུན་དུ་སྤངས། །
en: Stainless and purged of all defilements,

source: སེམས་ནི་རྟག་ཏུ་དག་ཅིང་དྲི་མེད་པ། །
en: The mind is stainless and perpetually pure.

source: འདི་ནི་རིན་ཆེན་སྒྲོན་མའི་གཟུངས་ཡིན་ནོ། །
en: Such is the jewel lamp dhāraṇī.

source: ལུས་ཀྱིས་ངག་རྣམས་དག་ཅིང་ཡིད་ཀྱིས་ནི། །ཟླ་བ་ལྟ་བུར་དྲི་བྲལ་དྲི་མེད་འོད། །
en: “ ‘Through body, verbal expressions, and mind, One is luminous, stainless, and free of blemish like the moon.

source: བྱམས་པའི་སེམས་དང་ཡིད་ཀྱང་སྙོམས་གྱུར་པ། །འདི་ནི་རིན་ཆེན་སྒྲོན་མའི་གཟུངས་ཡིན་ནོ། །
en: One has a loving intent and mental equanimity. Such is the jewel lamp dhāraṇī.

source: གཉིས་སུ་ལྟ་བ་དག་ལས་རྣམ་གྲོལ་ཞིང་། །རྟོག་དང་རྣམ་པར་རྟོག་དང་ཀུན་དུ་བྲལ། །འདུ་ཤེས་རྣམས་ནི་ཡོངས་སུ་ཤེས་གྱུར་པ། །
en: “ ‘Released from dualistic views And freed from all thoughts and conceptualizing, One comprehends all conceptions.

source: དྲན་དང་བློ་གྲོས་རྟོག་ལ་འཇུག་པ་འགྲུབ། །
en: “ ‘Engaged in mindfulness, intelligence, and understanding

source: ཤེས་རབ་ཆེ་ལྡན་ཡོན་ཏན་རྣམས་དང་ལྡན། །
en: And endowed with qualities and vast insight,

source: ནམ་མཁའི་དཀྱིལ་ལྟར་དྲི་མ་མེད་ཅིང་དག །
en: One is pure and stainless like the center of the sky.

source: དཀོན་མཆོག་གསུམ་པོ་རྒྱུན་མི་འཆད་པ་དང་། །དྲི་གསུམ་རྣམ་སྤངས་སྲིད་པ་གསུམ་ལས་གྲོལ། །
en: “ ‘The Three Jewels are an unbroken continuity. One is freed from the three existences, the three stains having been relinquished,

source: གཉིས་ལ་ཡིད་གཉིས་ཟ་བ་མཐར་འབྱིན་པ། །
en: And the duality of a doubting dualistic mind is terminated.

source: རིན་ཆེན་སྒྲོན་མའི་གཟུངས་ནི་དག་པ་ཡིན། །
en: Such is the jewel lamp dhāraṇī.

source: འདོད་ཆགས་དང་ནི་ཞེ་སྡང་གཏི་མུག་བཅོམ། །
en: “ ‘Desire, aversion, and ignorance conquered,

source: དུས་ངན་རྙོག་སྤངས་ཡོན་ཏན་ཀུན་དང་ལྡན། །
en: One is endowed with all qualities, the dregs of degenerate times left behind,

source: ཉོན་མོངས་མུན་པ་རབ་རིབ་སེལ་བྱེད་པ། །
en: And the visual distortion of obstructing afflictive emotions is removed.

source: རིན་ཆེན་སྒྲོན་མ་གཟུངས་ཀྱི་མཆོག་ཡིན་ནོ། །
en: Such is the supreme jewel lamp dhāraṇī.

source: འཇིག་རྟེན་དག་ན་སྒྲ་སྐད་ཐ་མ་དང་། །འབྲིང་དང་མཆོག་ནི་ཇི་སྙེད་ཡོད་པ་དག །སྒྲ་རྣམས་ཀུན་ལ་ཤིན་ཏུ་ཞུགས་གྱུར་པ། །
en: “ ‘One having become immersed in all languages, As many as there are in the worlds, The lowest, the mediocre, and the highest,

source: རིན་ཆེན་སྒྲོན་མའི་གཟུངས་ནི་རྡུལ་དང་བྲལ། །
en: The jewel lamp dhāraṇī remains unsullied.

source: ཟབ་མོའི་ཆོས་རྣམས་དང་ནི་ལྡན་གྱུར་ཅིང་། །ཚིག་དང་ཡིག་འབྲུ་སྣ་ཚོགས་མཐའ་ཡས་མང་། །
en: “ ‘Endowed with profound teachings And with infinite and multifarious words and syllables,

source: བདག་དང་སེམས་ཅན་དག་ཏུ་ལྷུང་བ་མེད། །
en: One is without failure for oneself or others.

source: གཉིས་མེད་ལྡན་པ་འདི་ནི་གཟུངས་ཡིན་ནོ། །
en: Such is this dhāraṇī that is endowed with nonduality.

source: སོ་སོ་ཡང་དག་རིག་པ་ཐོབ་གྱུར་ཅིང་། །
en: “ ‘The four types of discriminating knowledge are attained,

source: རྐང་པ་སྙིང་པོ་བཞི་ལ་རབ་གནས་ཏེ། །
en: The four bases of miraculous powers are established,

source: བསམ་གཏན་བཞི་དང་ཡང་དག་རབ་ལྡན་པ། །
en: And the four concentrations are embodied.

source: དམ་པའི་དོན་གྱི་ཆོས་ཀྱི་ཚུལ་གྱུར་ཅིང་། །ཚངས་པའི་གནས་པ་བཞི་དང་བསྡུ་དང་ལྡན། །
en: “ ‘Being the system of teachings of the ultimate meaning, And possessing the four abodes of Brahmā and the means of attraction,

source: མངོན་པར་ཤེས་པ་ལྔ་ལ་འགྲོ་བྱེད་པ། །
en: One sets in motion the five kinds of superknowledge.

source: དྲན་པ་ཉེ་བར་གཞག་པ་རྣམས་ལ་གནས། །ཡང་དག་སྤོང་བ་རྣམས་དང་རྟག་ཏུ་འཐུན། །
en: “ ‘Being established in the applications of mindfulness And in harmony with the correct exertions,

source: རྫུ་འཕྲུལ་རྐང་པ་བཞི་ལ་སྤྱོད་བྱེད་པ། །
en: One activates the four bases of miraculous powers.

source: དབང་པོ་ལྔ་པོ་དག་དང་ལྡན་གྱུར་ཅིང་། །སྟོབས་ལྔ་དག་ལ་གནས་པ་མི་གཡོའི་ཤུགས། །
en: “ ‘Endowed with the five spiritual faculties And established with five strengths,

source: བྱང་ཆུབ་ཡན་ལག་རྣམས་དང་རབ་ལྡན་པ། །
en: One is endowed with the factors of awakening, an unwavering force.

source: ཡན་ལག་བརྒྱད་པའི་ལམ་གྱིས་འགྲོ་བྱེད་ཅིང་། །ཞི་གནས་མཆོག་དང་ལྷག་མཐོང་ཟུང་དུ་འབྲེལ། །རིག་དང་རྣམ་པར་གྲོལ་བས་འགྲོ་བྱེད་པ། །
en: “ ‘Motivated by the eightfold path, Supreme tranquil abiding and special insight are united, And one is motivated by awareness and liberation.

source: ས་རྣམས་གནོན་པ་དག་ནི་རབ་ལྡན་ཞིང་། །མཚམས་སྦྱོར་གྲོལ་བའི་ལམ་དང་རྗེས་སུ་འཐུན། །ཉེས་པ་རྣམས་ནི་ཀུན་དུ་སྤངས་གྱུར་པ། །
en: “ ‘One being endowed with the spiritual levels to be mastered And in harmony with the unifying path of freedom, All faults are totally abandoned.

source: འཇིག་རྟེན་ཐམས་ཅད་ན་ནི་སྣང་བྱེད་ཅིང་། །ཉི་དང་ཟླ་ཡི་འོད་ཀྱི་དཀྱིལ་འཁོར་ལྟར། །རྣམ་པར་དག་ཅིང་མིག་ནི་འབྱེད་བྱེད་པ། །
en: “ ‘One sheds light on all worlds Like the luminous orbs of the sun and the moon, Which are pure and eye opening.

source: འདིར་ནི་ལྷ་མིག་དག་སྟེ་རབ་རིབ་མེད། །
en: “ ‘Here the pure divine eye is without visual distortion,

source: ཤེས་རབ་མཆོག་གི་མིག་ཀྱང་རྣམ་དག་པ། །འདིར་ནི་ཆོས་ཀྱི་མིག་ཀྱང་དག་གྱུར་ཏེ། །
en: And the eyes of supreme insight are pure. Here, the eyes of Dharma are likewise pure,

source: རྒྱལ་བ་དམ་པའི་སྤྱན་ནི་རྣམ་པར་དག །
en: And the authentic vision of the Victor is pure.

source: འདིར་ནི་ཉོན་མོངས་བདུད་ཀྱང་དག་པར་གྱུར། །
en: “ ‘Here the māra of afflictive emotions is purified,

source: ཕུང་པོ་ལྔ་ཡི་ཉེས་པ་འདིར་ཡོངས་དག །
en: And the māra of aggregates is purified.

source: འདིར་ནི་འཆི་བདག་བདུད་ཀྱང་དག་གྱུར་ཅིང་། །འདིར་ནི་སྡེ་དང་བཅས་པའི་བདུད་ཀྱང་བཅོམ། །
en: Here the māra of the Lord of Death is purified, And here the māra of sectarianism is also conquered.

source: འདིར་ནི་གཟུངས་ལ་རབ་ཏུ་གནས་ནས་སུ། །བྱེ་བ་ཁྲག་ཁྲིག་དག་གི་ཞིང་དུ་འགྲོ། །
en: “ ‘One who abides in this dhāraṇī May travel to many different realms,

source: སངས་རྒྱས་ཁྲག་ཁྲིག་དག་ཀྱང་མཐོང་འགྱུར་ཞིང་། །བླ་ན་མེད་པའི་ཆོས་ཀྱང་ཉན་པར་བྱེད། །
en: Behold vast numbers of buddhas, And listen to the highest Dharma.

source: རྒྱ་ཆེན་ཆོས་ནི་ཐོས་པར་གྱུར་ནས་ཀྱང་། །གཟུངས་ཀྱི་དྲན་པའི་སྟོབས་ཀྱིས་འཛིན་པར་བྱེད། །
en: “ ‘Hearing extensive teachings, One retains them through the power of mindful dhāraṇī.

source: དོན་དང་ཚིག་འབྲུ་དག་ཀྱང་གཟུངས་ལྡན་པར། །སེམས་ཅན་ཐམས་ཅད་ལ་ནི་སྟོན་པར་བྱེད། །
en: One even manages to retain the meanings and syllables And thereby teach all beings.

source: རྒྱུ་དང་རྐྱེན་གྱིས་རྣམ་པར་ཕྱེ་བས་ན། །
en: “ ‘When classified by way of causes and conditions,

source: སེམས་ནི་སྐད་ཅིག་འཇིག་པར་ཤེས་གྱུར་ཏེ། །
en: Mind is understood to disintegrate moment by moment.

source: ཆོས་རྣམས་རབ་ཏུ་དབྱེ་བ་ཤེས་ཐོབ་པ། །གཟུངས་འདི་ལ་ནི་གནས་པར་གྱུར་པ་ཡིན། །
en: Attaining knowledge of how phenomena are classified, One abides in this dhāraṇī.

source: སྤོབས་པ་ཐོབ་ཅིང་གསུམ་རིག་ཆགས་པ་མེད། །
en: “ ‘One attains eloquence and is unobstructed in threefold awareness.

source: མིག་གསུམ་རྣམ་པར་དག་པའང་རབ་ཏུ་ཐོབ། །
en: One attains purification of the three eyes

source: རྣམ་པར་ཐར་པ་གསུམ་གྱི་དོན་ཀྱང་ཐོབ། །
en: And the goal of the three liberations.

source: འདིར་ནི་གཟུངས་རྣམས་ཐོབ་པར་གྱུར་དང་ལྡན། །
en: Here, one is endowed with attainment of dhāraṇīs.

source: གང་དག་གཟུངས་རྣམས་མང་པོ་གཞལ་ཡས་ཤིང་། །ཚད་མེད་པ་དག་ངེས་པར་བསྟན་པ་ཡང་། །གཟུངས་ཀྱི་དམ་པ་འདི་ནི་ཐོབ་གྱུར་ན། །དེ་དག་ཐམས་ཅད་རབ་ཏུ་ཐོབ་པར་འགྱུར། །
en: “ ‘Although the exegesis of the many dhāraṇīs Is unfathomable and boundless, Having attained this excellent dhāraṇī, They are all mastered.

source: བསམ་གཏན་གང་དང་རྣམ་ཐར་གང་དག་དང་། །སྙོམས་འཇུག་ཏིང་འཛིན་གང་དག་མཐའ་ཡས་དང་། །མངོན་པར་ཤེས་པས་རྣམ་པར་རོལ་དང་གཟུངས། །མཐའ་ཡས་དེ་དག་ལ་ནི་རབ་ཏུ་འཇུག །
en: “ ‘One enters the infinite concentrations and liberations, Equipoises and absorptions, The playful expressions of superknowledge, And the infinite dhāraṇīs.

source: ཇི་ལྟར་རྒྱ་མཚོ་དཔག་ཏུ་མེད་པ་ལ། །མཐའ་ཡས་སྒོ་ནས་ཀླུང་མཚོ་མཚེའུ་འཇུག་པ། །
en: “ ‘Just as rivers, lakes, and ponds Flow into the vast and endless ocean through limitless channels,

source: དེ་ལྟར་གཟུངས་འདི་འཛིན་པར་བྱེད་པ་ཡང་། །མཐའ་ཡས་ཆོས་རྣམས་ཀྱི་ནི་སྒོ་མོར་འཇུག །
en: Those who uphold this dhāraṇī Pass through gateways of infinite teachings.

source: ཟད་པ་མེད་པའི་སྒྲ་ལ་འཇུག་པ་ཡང་། །ཟད་པ་མེད་པའི་ཤེས་པས་ཁོང་དུ་ཆུད། །
en: “ ‘Engaging in countless languages, One masters them all through boundless understanding.

source: གཟུངས་འདི་སྨྲ་བར་བྱེད་པ་དེ་ཡི་ནི། །བསོད་ནམས་ཐམས་ཅད་ཟད་པར་མི་འགྱུར་རོ། །
en: For those who proclaim this dhāraṇī, Merit will never be exhausted.

source: གཟུངས་འདི་རབ་ཏུ་ཐོབ་པར་གྱུར་པ་ནི། །རིན་ཆེན་དམ་པ་དྲི་མེད་ལག་ཏུ་འགྱུར། །
en: “ ‘Those who attain this dhāraṇī Will hold a supreme, flawless jewel in their hands.

source: གཟུགས་དང་མཚན་རྣམས་དང་ནི་རིགས་དང་ཡང་། །རུས་དང་སྐྱེ་བ་དག་ནི་རྣམ་པར་དག །
en: Their bodies, names, families, Clans, and births will be pure.

source: ཟབ་མོའི་ཚུལ་དག་ལ་ནི་འཇུག་པ་དང་། །མི་སྐྱེ་བ་ལ་བཟོད་དང་མ་སྐྱེས་དང་། །ཕྱིར་མི་ལྡོག་པའི་ཤེས་པའི་ས་དག་ཀྱང་། །གཟུངས་འདི་ཡིན་པར་ངེས་པར་བསྟན་པ་ཡིན། །
en: “ ‘The engagement in profound methods, The acceptance of nonarising, And the levels of understanding the unoriginated and irreversible Are definitively taught to be this dhāraṇī.

source: བྱང་ཆུབ་བླ་མེད་མཆོག་འདི་ཚོལ་བྱེད་པའི། །བྱང་ཆུབ་སེམས་དཔའ་མང་པོ་གང་དག་གིས། །གཟུངས་འདི་རབ་ཏུ་ཐོབ་པར་གྱུར་ན་ནི། །བྱང་ཆུབ་བླ་ན་མེད་པ་རྙེད་མི་དཀའ། །
en: “ ‘When all bodhisattvas who seek Unsurpassed supreme awakening Have attained this dhāraṇī, The highest awakening will not be hard to find.

source: གང་དག་ཕྱོགས་བཅུ་རྣམས་ན་བདེ་བར་གཤེགས། །འགྲོ་ལ་ཕན་དང་བདེ་ཕྱིར་ཆོས་སྟོན་པ། །གཟུངས་ཀྱི་དམ་པ་འདི་ནི་ཐོབ་གྱུར་ན། །
en: “ ‘Once the sugatas of the ten directions, Who teach Dharma to benefit and delight people, Have attained the excellence of this dhāraṇī,

source: དེ་དག་སྤོབས་པ་རྒྱུན་ཆད་མི་འགྱུར་རོ། །
en: Their eloquence will be uninterrupted.

source: གཟུངས་འདི་རབ་ཏུ་ཐོབ་པར་གྱུར་པ་དག །དགའ་དང་མོས་དང་བསམ་པ་ཤེས་ནས་ནི། །དེ་དག་འབྲས་བུ་ཡོད་པ་སྟོན་པས་ན། །
en: “ ‘When those who have attained this dhāraṇī Understand the joys, aspirations, and thoughts of beings, They will teach them the fruition that is ever-present,

source: སེམས་ཅན་ཁྲག་ཁྲིག་དག་ནི་ཚིམ་པར་བྱེད། །
en: And thus bring satisfaction to vast numbers of beings.

source: གཟུངས་འདི་ལ་ནི་གནས་པའི་དཔའ་བོ་དག །འཁོར་ལོ་དམ་པ་རབ་ཏུ་སྐོར་བྱེད་ཅིང་། །
en: “ ‘Brave ones abiding in this dhāraṇī Turn the wheel of the sacred Dharma

source: སེམས་ཅན་སྡུག་བསྔལ་སྣ་ཚོགས་རྣམས་ལས་འགྲོལ། །ཐེག་པ་དམ་པ་ལ་ཡང་འཇོག་པར་བྱེད། །
en: And thus free beings from their sundry forms of suffering, Setting them in the excellent vehicle.

source: བསྐལ་པ་བྱེ་བ་ཁྲག་ཁྲིག་མང་པོར་ནི། །བསྔགས་དང་ཡོན་ཏན་ལེགས་པ་བརྗོད་བྱས་ཀྱང་། །དྲང་སྲོང་ཆེན་པོས་དེ་ཡི་ཡོན་ཏན་གྱི། །མཐའ་མ་བརྗོད་དུ་ནུས་པར་མི་འགྱུར་རོ། །
en: “ ‘The great sages may, for many eons, Praise and extoll its qualities, But they will not manage to express The full extent of its qualities.’

source: རིགས་ཀྱི་བུ་དེ་ལྟར་བཅོམ་ལྡན་འདས་དེ་བཞིན་གཤེགས་པ་དྲི་མ་མེད་པར་སྣང་བ་དེས་གཟུངས་བསྟན་པ་འདི་བཤད་པ་ན། བྱང་ཆུབ་སེམས་དཔའི་འཁོར་ཆེན་པོ་དེ་ལས་བྱང་ཆུབ་སེམས་དཔའ་སྟོང་ཕྲག་སུམ་ཅུ་རྩ་གཉིས་ཀྱིས་གཟུངས་ཐོབ་པར་གྱུར་ཏོ། །བྱང་ཆུབ་སེམས་དཔའ་སེམས་དཔའ་ཆེན་པོ་འོད་དཔལ་གྱིས་ནི་རིན་ཆེན་སྒྲོན་མའི་གཟུངས་འདི་ཐོབ་པར་གྱུར་ཏོ། །
en: “As the Blessed Tathāgata Stainless Illumination gave this dhāraṇī teaching, thirty-two thousand bodhisattvas within the great bodhisattva assembly attained the dhāraṇī, among them the bodhisattva mahāsattva Glorious Light.

source: གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཁྱོད་དེའི་ཚེ་དེའི་དུས་ན། བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་ཞེས་བྱ་བར་གྱུར་པ་དེ་གཞན་ཞིག་ཡིན་པ་སྙམ་དུ་དོགས་ཤིང་ཡིད་གཉིས་སུ་གྱུར་ཏམ། ཐེ་ཚོམ་ཟ་བ་ལྟ་ན། ཁྱོད་ཀྱིས་དེ་ལྟར་མི་བལྟའོ། །
en: Dhāraṇīśvara­rāja, you may reflect or wonder, doubt, or regard with skepticism whether the bodhisattva of this period known as Glorious Light was someone else, but you should not!

source: ཁྱོད་ཉིད་དེའི་ཚེ་དེའི་དུས་ན་བྱང་ཆུབ་སེམས་དཔའ་འོད་དཔལ་ཞེས་བྱ་བར་གྱུར་ཏེ།
en: Because really you yourself were the bodhisattva of that period known as Glorious Light!

source: གཟུངས་ཀྱི་དབང་ཕྱུག་གི་རྒྱལ་པོ་ཁྱོད་ཀྱིས་དེ་ཚུན་ཆད་བགྲང་བ་ལས་འདས་པའི་དེ་བཞིན་གཤེགས་པ་དག་ལ་གཟུངས་རྣམ་པར་ངེས་པ་འདི་ཡོངས་སུ་དྲིས་སོ། །
en: Dhāraṇīśvara­rāja, you have requested countless tathāgatas since time immemorial for this analysis of dhāraṇī.

source: ཡོངས་སུ་དྲི་བ་བྱས་སོ། །
en: You have made such an inquiry.

source: དེས་ན་ཁྱོད་ད་ལྟར་ཡང་དེ་བཞིན་གཤེགས་པ་ལ་ཡོངས་སུ་འདྲི་བ་དེ་ལྟར་འཇིགས་པ་མེད་ཅིང་གཟུངས་ཀྱི་རྣམ་པར་ངེས་པ་འདིའང་སྟོན་ཏོ། །
en: “That is why you again have made a request to the Tathāgata and have fearlessly delivered this dhāraṇī analysis.

source: ཁྱོད་ཀུན་དུ་ལྟ་བའི་བློས་ཆོས་འདི་མངོན་སུམ་དུ་གྱུར་པས་རྣམ་གྲངས་འདིས་ན་ངས་ཁྱོད་བྱང་ཆུབ་སེམས་དཔའ་གཟུངས་ཐོབ་པ་དང་། བྱང་ཆུབ་སེམས་དཔའ་དྲན་པ་དང་ལྡན་པ་རྣམས་ཀྱི་མཆོག་ཏུ་བསྟན་ཏོ། །
en: Since you have realized this Dharma with your all-seeing intelligence, with this discourse I declare you to be supreme among bodhisattvas endowed with mindfulness and among the bodhisattvas who have attained dhāraṇī.”

source: དེ་ནས་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ཞེས་བྱ་བ་འཁོར་དེ་ཉིད་དུ་འདུག་པར་གྱུར་པ་དེས། བཅོམ་ལྡན་འདས་ལ་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: At this point, a bodhisattva known as Prajñākūṭa, who was present in that assembly, asked,

source: བཅོམ་ལྡན་འདས་ཇི་ལྟར་ན་བྱང་ཆུབ་སེམས་དཔའ་རིན་ཆེན་སྒྲོན་མའི་གཟུངས་འདི་རབ་ཏུ་ཐོབ་ཅིང་།
en: “How, Blessed One, do bodhisattvas attain this jewel lamp dhāraṇī?

source: ཐོབ་ནས་ཀྱང་ཆབ་འཚལ་བར་མི་བགྱིད་པ་དང་། འདི་ལྟ་སྟེ།
en: And having attained it, how do they avoid losing it?

source: གཟུངས་ཀྱི་སྟོབས་བསྐྱེད་པས་སེམས་ཅན་ཐམས་ཅད་ཉེ་བར་འཚོ་བ་ལགས།
en: And having generated the power of the dhāraṇī, how do they sustain all sentient beings?”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ལ་འདི་སྐད་ཅེས་བཀའ་སྩལ་ཏོ། །
en: The Blessed One replied,

source: རིགས་ཀྱི་བུ་གང་གི་ཚེ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་ཀྱི་རྩ་བ་ལ་གནས་པར་གྱུར་པ་དང་། ཤེས་རབ་ཀྱི་ལས་བྱེད་པར་གྱུར་པ་དེའི་ཚེ་གཟུངས་འདི་རབ་ཏུ་འཐོབ་བོ། །
en: “Son of noble family, when bodhisattvas abide by the sources of insight and perform the functions of insight, they will attain this dhāraṇī.

source: ཆུད་ཟ་བར་མི་བྱེད་དོ། །
en: There is no doubt about it.

source: སེམས་ཅན་ཐམས་ཅད་ཀྱི་ཉེ་བར་འཚོ་བར་ཡང་འགྱུར་རོ། །
en: They will nurture all beings.”

source: བཅོམ་ལྡན་འདས་ལ་བྱང་ཆུབ་སེམས་དཔའ་ཤེས་རབ་བརྩེགས་ཀྱིས་འདི་སྐད་ཅེས་གསོལ་ཏོ། །
en: Prajñākūṭa asked in turn,

source: བཅོམ་ལྡན་འདས་ཤེས་རབ་ཀྱི་རྩ་བ་ནི་གང་ལགས། ཤེས་རབ་ཀྱི་ལས་ནི་གང་ལགས། དེ་བཞིན་གཤེགས་པས་ལེགས་པར་བཤད་དུ་གསོལ།
en: “Blessed One, what are the sources and functions of insight? Please explain it to me.”

source: བཅོམ་ལྡན་འདས་ཀྱིས་བཀའ་སྩལ་པ།
en: The Blessed One replied,

source: དེའི་ཕྱིར་རིགས་ཀྱི་བུ་ཁྱོད་ཤིན་ཏུ་ལེགས་པར་ཉོན་ལ་ཡིད་ལ་ཟུང་ཤིག་དང་། ངས་ཁྱོད་ལ་བཤད་པར་བྱའོ། །
en: “Because of your request, son of noble family, listen carefully and bear in mind what I tell you. These are the sources of insight and their corresponding functions:

source: རིགས་ཀྱི་བུ་བྱང་ཆུབ་སེམས་དཔའ་མ་ཐོས་པའི་ཆོས་ཉན་པ་གང་ཡིན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Son of noble family, listening to teachings not yet heard is a source of insight.

source: ཇི་ལྟར་ཐོས་པའི་ཆོས་གཞན་དག་ལ་རྒྱ་ཆེར་ཡང་དག་པར་སྟོན་པ་གང་ཡིན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to teach others the Dharma one has heard in detail.

source: དཔྱོད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Investigation is a source of insight.

source: གང་དཔྱད་པ་གཞན་དག་ལ་ཉེ་བར་སྟོན་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to teach others what one has investigated.

source: ཚུལ་བཞིན་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Proper discernment is a source of insight.

source: སེམས་ཅན་རྣམས་ཚུལ་བཞིན་ལ་རབ་ཏུ་དགོད་པ་འདི་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to establish beings in what is appropriate.

source: ཡང་དག་པར་སྦྱོར་བ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Application is a source of insight.

source: ཡང་དག་པར་སྒྲུབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to accomplish.

source: སེམས་ལ་ངེས་པར་སེམས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Thinking decisively about mind is a source of insight.

source: སེམས་ལ་ངེས་པར་སེམས་པ་ཡང་དག་པར་སྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to teach decisive thinking about mind.

source: རབ་ཏུ་དབེན་པར་གནས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Dwelling in solitude is a source of insight.

source: ལུས་དང་སེམས་དབེན་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know how to isolate body and mind.

source: གཅིག་པུར་དགའ་བ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Delighting in solitude is a source of insight.

source: གཅིག་པུར་བགྲོད་པའི་ལམ་སྒྲུབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to accomplish a solitary path.

source: ཞི་གནས་དང་ལྷག་མཐོང་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Cultivating tranquil abiding and special insight is a source of insight.

source: རིག་པ་དང་རྣམ་པར་གྲོལ་བ་འཐོབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to attain awareness and liberation.

source: རྣམ་པར་ཐར་པ་གསུམ་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Cultivating the three liberations is a source of insight.

source: རིག་པ་གསུམ་མངོན་སུམ་དུ་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to realize threefold awareness.

source: དྲན་པ་ཉེ་བར་གཞག་པ་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Cultivating the application of mindfulness is a source of insight.

source: དྲན་པ་མེད་ཅིང་ཡིད་ལ་བྱེད་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is the absence of mindfulness and mental activity.

source: ཡང་དག་པར་སྤོང་བ་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Cultivating abandonment is a source of insight.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་སྤངས་པར་རབ་ཏུ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know all phenomena to be naturally abandoned.

source: རྫུ་འཕྲུལ་གྱི་རྐང་པ་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Cultivating the bases of miraculous powers is a source of insight.

source: མངོན་པར་འདུ་བྱ་བ་མེད་པ་རྫུ་འཕྲུལ་ཐོབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to attain miraculous power without manifestation.

source: དད་པས་མོས་ཏེ་ཡིད་ཆེས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Confidence with faithful devotion is a source of insight.

source: ཆགས་པ་ཐམས་ཅད་ལས་ཡང་དག་པར་འདའ་བ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to transcend all attachments.

source: སེམས་མི་འཇུམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Dauntlessness is a source of insight.

source: ལུས་དང་སེམས་ཤིན་ཏུ་སྦྱངས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to be well trained in body and mind.

source: དྲན་པ་དང་ཤེས་བཞིན་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Mindfulness and introspection are sources of knowledge.

source: དྲན་པར་བྱ་བ་རྗེས་སུ་དྲན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Their function is to attend to what is to be recollected.

source: ཏིང་ངེ་འཛིན་རིམ་གྱིས་རྗེས་སུ་རྟོགས་པར་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Gaining realization in the levels of meditative absorption is a source of insight.

source: རྟག་ཏུ་མཉམ་པར་བཞག་པར་གནས་པ་འཐོབ་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to attain constant presence in equipoise.

source: ཤེས་རབ་ཀྱི་དབང་པོ་ལ་སྟེན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Relying on the faculty of insight is itself a source of insight.

source: དབང་པོ་མཆོག་དང་མཆོག་མ་ཡིན་པ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know which faculties are best and which are not.

source: སྟོབས་ལྔའི་གནས་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Knowing the five strengths is a source of insight.

source: བདུད་དང་ཉོན་མོངས་པས་མི་རྫི་བ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is not to be crushed by evil and afflictive emotions.

source: བྱང་ཆུབ་ཀྱི་ཡན་ལག་རྗེས་སུ་འཐུན་པའི་བཟོད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Harmoniously accepting the factors of awakening is a source of insight.

source: ཆོས་ཐམས་ཅད་ཀྱི་རང་བཞིན་རྗེས་སུ་རྟོགས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to harmoniously realize the nature of all phenomena.

source: ལམ་གྱི་ཡན་ལག་ཡང་དག་པར་སྒྲུབ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Practicing the branches of the path is a source of insight.

source: ཆོས་ཐམས་ཅད་གཟིངས་ལྟ་བུར་ཤེས་ནས་ཆོས་དང་ཆོས་མ་ཡིན་པ་ལ་མི་གནས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is not to be partisan toward Dharma or non-Dharma by understanding that all teachings are like rafts.

source: སྡུག་བསྔལ་དང་། ཀུན་འབྱུང་བ་དང་། འགོག་པ་དང་། ལམ་སྒོམ་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Familiarizing oneself with suffering and its origin, cessation, and the path is a source of insight.

source: འགོག་པ་མངོན་སུམ་དུ་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to actualize cessation.

source: དྲང་བའི་དོན་གྱི་མདོ་སྡེ་ཀུན་ཆུབ་པར་བྱེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Mastering the sūtras of provisional meaning is a source of insight.

source: ངེས་པའི་དོན་གྱི་མདོ་སྡེ་ལ་རྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to rely on the sūtras of definitive meaning.

source: ཐོས་པ་ཐམས་ཅད་འཛིན་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Retaining everything that one has learned is a source of insight.

source: དོན་ལ་རྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to rely on the meaning.

source: རྣམ་པར་ཤེས་པ་ལ་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Investigating consciousness is a source of insight.

source: ཡེ་ཤེས་ལ་རྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to rely on wisdom.

source: གང་ཟག་གི་སྒྲ་ལ་མངོན་པར་ཞེན་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Not clinging to the words of an individual is a source of insight.

source: ཆོས་ཉིད་ལ་རྟོན་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to rely on the nature of reality.

source: འདུ་བྱེད་ཐམས་ཅད་མི་རྟག་པར་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Discerning that all karmic formations are impermanent is a source of insight.

source: གདོད་མ་ནས་མ་སྐྱེས་པར་རབ་ཏུ་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know fundamental nonorigination.

source: འདུ་བྱེད་ཐམས་ཅད་སྡུག་བསྔལ་བར་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Comprehending analytically that all formations are painful is a source of insight.

source: ཆོས་ཐམས་ཅད་མངོན་པར་འདུ་བྱ་བ་མེད་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know that all phenomena are not actually conditioned.

source: ཆོས་ཐམས་ཅད་ལ་བདག་མེད་པར་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Discerning that phenomena are selfless is a source of insight.

source: སེམས་ཅན་གཟོད་མ་ནས་རྣམ་པར་དག་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know that beings are primordially pure.

source: མྱ་ངན་ལས་འདས་པ་ལ་ཞི་བར་སོ་སོར་རྟོག་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Discerning that nirvāṇa is peace is a source of insight.

source: ཆོས་ཐམས་ཅད་རང་བཞིན་གྱིས་ཡོངས་སུ་མྱ་ངན་ལས་འདས་པར་ཤེས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to know that all phenomena are nirvāṇa by nature.

source: དོན་ཐོས་ནས་སྐྲག་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: “Being unintimidated when one hears the truth is a source of insight.

source: དོན་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to have special awareness of the truth.

source: ཡང་དག་པའི་ཆོས་ཉིད་ཐོས་ནས་སྐྲག་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being unintimidated when one hears of the nature of reality is a source of insight.

source: ཆོས་ཐམས་ཅད་ཡང་དག་པར་རིག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to have special awareness of all phenomena.

source: ངེས་པའི་ཚིག་ཐམས་ཅད་ལ་སྐྲག་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being unintimidated by any etymologies is a source of insight.

source: ངེས་པའི་ཚིག་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to have special awareness of etymologies.

source: སངས་རྒྱས་ཀྱི་སྤོབས་པ་ཐོས་ནས་སྐྲག་པ་མེད་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Being unintimidated when one hears the Buddha’s eloquence is a source of insight.

source: སྤོབས་པ་སོ་སོ་ཡང་དག་པར་རིག་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to have special awareness of eloquence.

source: སེམས་ཅན་ལ་དམིགས་པ་དང་། ཆོས་ལ་དམིགས་པའི་བྱམས་པ་ནི་ཤེས་རབ་ཀྱི་རྩ་བའོ། །
en: Feeling love toward beings and phenomena is a source of insight.

source: དམིགས་པ་མེད་པའི་བྱམས་པ་ནི་ཤེས་རབ་ཀྱི་ལས་སོ། །
en: Its function is to experience nonreferential love.
